run/NACA4413__AoA0_kOmegaSST/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  7
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/																
FoamFile																
{																
    version     2.0;																
    format      ascii;																
    class       dictionary;																
    object      blockMeshDict;																
}																
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

															
scale 1;														
                                                                
geometry																
{																
}	

vertices
(
               															
	                    ( 0.0 0.0 0.0) // 0
   ( 1.0 0.001364999999999976 0.0) // 1
                   ( 1.0 10.0 0.0) // 2
                  ( -10.0 0.0 0.0) // 3
  ( 15.0 0.001364999999999976 0.0) // 4
                  ( 15.0 10.0 0.0) // 5
  ( 1.0 -0.001364999999999976 0.0) // 6
 ( 15.0 -0.001364999999999976 0.0) // 7
                  ( 1.0 -10.0 0.0) // 8
                 ( 15.0 -10.0 0.0) // 9
                   ( 0.0 0.0 1.0) // 10
  ( 1.0 0.001364999999999976 1.0) // 11
                  ( 1.0 10.0 1.0) // 12
                 ( -10.0 0.0 1.0) // 13
 ( 15.0 0.001364999999999976 1.0) // 14
                 ( 15.0 10.0 1.0) // 15
 ( 1.0 -0.001364999999999976 1.0) // 16
( 15.0 -0.001364999999999976 1.0) // 17
                 ( 1.0 -10.0 1.0) // 18
                ( 15.0 -10.0 1.0) // 19 
        );
        
blocks																
(																
	hex	(0 1 2 3 10 11 12 13)	( 300 100 1) simpleGrading (1 1000 1)   //block	0
																													
	hex	(1 4 5 2 11 14 15 12)	( 500 100 1) simpleGrading (15 1000 1)  //block	1														
               											
	hex	(6 7 4 1 16 17 14 11)	( 500 10 1) simpleGrading (15 1 1)      //block	2
																																								
	hex	(8 9 7 6 18 19 17 16)	( 500 100 1) simpleGrading (15 0.001 1) //block	3	
	
	hex	(3 8 6 0 13 18 16 10)	( 300 100 1) simpleGrading (1 0.001 1)  //block	4								
);		

edges																
(																
	arc	2 3	(-7 7 0)									
	arc	12 13	(-7 7 1)
	arc	8 3	(-7 -7 0)									
	arc	18 13	(-7 -7 1)									
																
	spline	0 1													
	(					      

                                         ( 0.0 0.0 0 ) 
 ( 0.00024671981657042874 0.003011056366373696 0 ) 
  ( 0.0009866357836101902 0.005980777568211032 0 ) 
  ( 0.0022190176933925554 0.008907977508307338 0 ) 
   ( 0.003942649333762649 0.011791184190268244 0 ) 
   ( 0.006155829688391956 0.014628648783357387 0 ) 
   ( 0.008856374615475837 0.017418358086832952 0 ) 
   ( 0.012041619003218151 0.020158050243675476 0 ) 
   ( 0.015708419399974638 0.022845233514267305 0 ) 
    ( 0.01985315711646002 0.025477207883824238 0 ) 
     ( 0.02447174179695788 0.02805108924368974 0 ) 
   ( 0.029559615456007327 0.030563835856436187 0 ) 
    ( 0.03511175697658486 0.033012276788478075 0 ) 
    ( 0.04112268706534028 0.035393141971924565 0 ) 
   ( 0.047586473659998074 0.037703093539972345 0 ) 
    ( 0.05449673778358616 0.039938758067472394 0 ) 
     ( 0.06184665983971649 0.04209675934054878 0 ) 
    ( 0.06962898634270315 0.044173751276374226 0 ) 
    ( 0.07783603707587677 0.046166450616426054 0 ) 
     ( 0.08645971267103159 0.04807166902368653 0 ) 
     ( 0.0954915026015235 0.049886344226178596 0 ) 
     ( 0.10492249358113281 0.05160756986573828 0 ) 
     ( 0.11474337836040116 0.05323262373174853 0 ) 
    ( 0.12494446491176331 0.054758994084367636 0 ) 
     ( 0.13551568599440833 0.05618440380019647 0 ) 
      ( 0.1464466090894303 0.05750683210490852 0 ) 
     ( 0.1577264466954656 0.058724533691640754 0 ) 
     ( 0.16934406697465365 0.05983605506040259 0 ) 
     ( 0.18128800473841744 0.06084024795186573 0 ) 
     ( 0.1935464727622202 0.061736279788094844 0 ) 
     ( 0.20610737341813284 0.06252364107249962 0 ) 
     ( 0.21895831061373222 0.06320214974096375 0 ) 
      ( 0.2320866020255476 0.06377195249517066 0 ) 
     ( 0.24547929161498316 0.06423352318705511 0 ) 
      ( 0.2591231624143632 0.06458765835953159 0 ) 
       ( 0.273004749570484 0.06483547008269425 0 ) 
       ( 0.287110353632798 0.06497837625608863 0 ) 
     ( 0.30142605407311807 0.06501808857600697 0 ) 
       ( 0.315937723023497 0.06495659839169517 0 ) 
      ( 0.3306310392187286 0.06479616069556887 0 ) 
       ( 0.345491502129707 0.06453927650976939 0 ) 
      ( 0.3605044462736979 0.06418867394446111 0 ) 
      ( 0.3756550556873999 0.06374728821205485 0 ) 
      ( 0.3909283785485107 0.06321824088598382 0 ) 
      ( 0.40630934193137186 0.0626048186927659 0 ) 
      ( 0.4217827666821252 0.06191045212193702 0 ) 
    ( 0.43733338239870584 0.061138694130171346 0 ) 
      ( 0.4529458425008854 0.06029319920371736 0 ) 
       ( 0.468604739375493 0.05937770302743052 0 ) 
      ( 0.4842946195818704 0.05839600298948353 0 ) 
      ( 0.4999999991025516 0.05735193972864462 0 ) 
      ( 0.5157053786241185 0.05624937990622778 0 ) 
     ( 0.5313952588331522 0.055092200357873905 0 ) 
      ( 0.5470541557121839 0.05388427375168082 0 ) 
      ( 0.5626666158205507 0.05262945584934227 0 ) 
     ( 0.5782172315450762 0.051331574436378855 0 ) 
       ( 0.593690656305524 0.04999441995674711 0 ) 
      ( 0.6090716196998196 0.04862173785658866 0 ) 
      ( 0.6243449425740935 0.04721722261212231 0 ) 
      ( 0.6394955520026742 0.04578451338814363 0 ) 
      ( 0.6545084961632448 0.04432719124673248 0 ) 
       ( 0.6693689590924875 0.0428487778009735 0 ) 
      ( 0.6840622753076503 0.04135273518614925 0 ) 
     ( 0.6985739442796073 0.039842467201284835 0 ) 
      ( 0.7128896447431308 0.03832132145738961 0 ) 
      ( 0.7269952488302514 0.03679259235547389 0 ) 
      ( 0.7408768360127569 0.03525952470758601 0 ) 
      ( 0.7545207068400739 0.03372531780782209 0 ) 
      ( 0.7679133964589709 0.03219312975755997 0 ) 
     ( 0.7810416879017434 0.030666081850047138 0 ) 
     ( 0.7938926251297652 0.029147262823857847 0 ) 
     ( 0.8064535258195331 0.027639732802503255 0 ) 
     ( 0.8187119938785907 0.026146526748445986 0 ) 
     ( 0.8306559316789744 0.024670657273703284 0 ) 
      ( 0.8422735519961111 0.02321511666583936 0 ) 
      ( 0.853553389641386 0.021782878007129698 0 ) 
     ( 0.8644843127769004 0.020376895285661202 0 ) 
      ( 0.8750555339012502 0.01900010241973056 0 ) 
      ( 0.8852566204954886 0.01765541114070042 0 ) 
     ( 0.8950775053187623 0.016345707704044733 0 ) 
     ( 0.9045084963434626 0.015073848423217347 0 ) 
      ( 0.9135402863200868 0.01384265404577629 0 ) 
     ( 0.9221639619623694 0.012654903015452051 0 ) 
     ( 0.9303710127436202 0.011513323687140064 0 ) 
     ( 0.9381533392955854 0.010420585583724716 0 ) 
     ( 0.9455032614015477 0.009379289803826229 0 ) 
     ( 0.9524135255757721 0.008391958707660073 0 ) 
    ( 0.9588773122218202 0.0074610250239063765 0 ) 
     ( 0.9648882423626697 0.006588820533539079 0 ) 
     ( 0.9704403839359932 0.005777564496748482 0 ) 
     ( 0.9755282576483886 0.005029351996240818 0 ) 
     ( 0.9801468423827797 0.004346142374200061 0 ) 
     ( 0.9842915801536527 0.003729747941000007 0 ) 
    ( 0.9879583806052372 0.0031818231313484324 0 ) 
    ( 0.9911436250481941 0.0027038542779942664 0 ) 
     ( 0.9938441700308243 0.002297150164531377 0 ) 
     ( 0.9960573504412771 0.001962833507358208 0 ) 
    ( 0.9977809821376927 0.0017018335027066797 0 ) 
     ( 0.9990133641036874 0.001514879558090701 0 ) 
    ( 0.9997532801270506 0.0014024963088501152 0 ) 
                    ( 1.0 0.001364999999999976 0 )  
    )
    spline 10 11
    (
                                         ( 0.0 0.0 1 ) 
 ( 0.00024671981657042874 0.003011056366373696 1 ) 
  ( 0.0009866357836101902 0.005980777568211032 1 ) 
  ( 0.0022190176933925554 0.008907977508307338 1 ) 
   ( 0.003942649333762649 0.011791184190268244 1 ) 
   ( 0.006155829688391956 0.014628648783357387 1 ) 
   ( 0.008856374615475837 0.017418358086832952 1 ) 
   ( 0.012041619003218151 0.020158050243675476 1 ) 
   ( 0.015708419399974638 0.022845233514267305 1 ) 
    ( 0.01985315711646002 0.025477207883824238 1 ) 
     ( 0.02447174179695788 0.02805108924368974 1 ) 
   ( 0.029559615456007327 0.030563835856436187 1 ) 
    ( 0.03511175697658486 0.033012276788478075 1 ) 
    ( 0.04112268706534028 0.035393141971924565 1 ) 
   ( 0.047586473659998074 0.037703093539972345 1 ) 
    ( 0.05449673778358616 0.039938758067472394 1 ) 
     ( 0.06184665983971649 0.04209675934054878 1 ) 
    ( 0.06962898634270315 0.044173751276374226 1 ) 
    ( 0.07783603707587677 0.046166450616426054 1 ) 
     ( 0.08645971267103159 0.04807166902368653 1 ) 
     ( 0.0954915026015235 0.049886344226178596 1 ) 
     ( 0.10492249358113281 0.05160756986573828 1 ) 
     ( 0.11474337836040116 0.05323262373174853 1 ) 
    ( 0.12494446491176331 0.054758994084367636 1 ) 
     ( 0.13551568599440833 0.05618440380019647 1 ) 
      ( 0.1464466090894303 0.05750683210490852 1 ) 
     ( 0.1577264466954656 0.058724533691640754 1 ) 
     ( 0.16934406697465365 0.05983605506040259 1 ) 
     ( 0.18128800473841744 0.06084024795186573 1 ) 
     ( 0.1935464727622202 0.061736279788094844 1 ) 
     ( 0.20610737341813284 0.06252364107249962 1 ) 
     ( 0.21895831061373222 0.06320214974096375 1 ) 
      ( 0.2320866020255476 0.06377195249517066 1 ) 
     ( 0.24547929161498316 0.06423352318705511 1 ) 
      ( 0.2591231624143632 0.06458765835953159 1 ) 
       ( 0.273004749570484 0.06483547008269425 1 ) 
       ( 0.287110353632798 0.06497837625608863 1 ) 
     ( 0.30142605407311807 0.06501808857600697 1 ) 
       ( 0.315937723023497 0.06495659839169517 1 ) 
      ( 0.3306310392187286 0.06479616069556887 1 ) 
       ( 0.345491502129707 0.06453927650976939 1 ) 
      ( 0.3605044462736979 0.06418867394446111 1 ) 
      ( 0.3756550556873999 0.06374728821205485 1 ) 
      ( 0.3909283785485107 0.06321824088598382 1 ) 
      ( 0.40630934193137186 0.0626048186927659 1 ) 
      ( 0.4217827666821252 0.06191045212193702 1 ) 
    ( 0.43733338239870584 0.061138694130171346 1 ) 
      ( 0.4529458425008854 0.06029319920371736 1 ) 
       ( 0.468604739375493 0.05937770302743052 1 ) 
      ( 0.4842946195818704 0.05839600298948353 1 ) 
      ( 0.4999999991025516 0.05735193972864462 1 ) 
      ( 0.5157053786241185 0.05624937990622778 1 ) 
     ( 0.5313952588331522 0.055092200357873905 1 ) 
      ( 0.5470541557121839 0.05388427375168082 1 ) 
      ( 0.5626666158205507 0.05262945584934227 1 ) 
     ( 0.5782172315450762 0.051331574436378855 1 ) 
       ( 0.593690656305524 0.04999441995674711 1 ) 
      ( 0.6090716196998196 0.04862173785658866 1 ) 
      ( 0.6243449425740935 0.04721722261212231 1 ) 
      ( 0.6394955520026742 0.04578451338814363 1 ) 
      ( 0.6545084961632448 0.04432719124673248 1 ) 
       ( 0.6693689590924875 0.0428487778009735 1 ) 
      ( 0.6840622753076503 0.04135273518614925 1 ) 
     ( 0.6985739442796073 0.039842467201284835 1 ) 
      ( 0.7128896447431308 0.03832132145738961 1 ) 
      ( 0.7269952488302514 0.03679259235547389 1 ) 
      ( 0.7408768360127569 0.03525952470758601 1 ) 
      ( 0.7545207068400739 0.03372531780782209 1 ) 
      ( 0.7679133964589709 0.03219312975755997 1 ) 
     ( 0.7810416879017434 0.030666081850047138 1 ) 
     ( 0.7938926251297652 0.029147262823857847 1 ) 
     ( 0.8064535258195331 0.027639732802503255 1 ) 
     ( 0.8187119938785907 0.026146526748445986 1 ) 
     ( 0.8306559316789744 0.024670657273703284 1 ) 
      ( 0.8422735519961111 0.02321511666583936 1 ) 
      ( 0.853553389641386 0.021782878007129698 1 ) 
     ( 0.8644843127769004 0.020376895285661202 1 ) 
      ( 0.8750555339012502 0.01900010241973056 1 ) 
      ( 0.8852566204954886 0.01765541114070042 1 ) 
     ( 0.8950775053187623 0.016345707704044733 1 ) 
     ( 0.9045084963434626 0.015073848423217347 1 ) 
      ( 0.9135402863200868 0.01384265404577629 1 ) 
     ( 0.9221639619623694 0.012654903015452051 1 ) 
     ( 0.9303710127436202 0.011513323687140064 1 ) 
     ( 0.9381533392955854 0.010420585583724716 1 ) 
     ( 0.9455032614015477 0.009379289803826229 1 ) 
     ( 0.9524135255757721 0.008391958707660073 1 ) 
    ( 0.9588773122218202 0.0074610250239063765 1 ) 
     ( 0.9648882423626697 0.006588820533539079 1 ) 
     ( 0.9704403839359932 0.005777564496748482 1 ) 
     ( 0.9755282576483886 0.005029351996240818 1 ) 
     ( 0.9801468423827797 0.004346142374200061 1 ) 
     ( 0.9842915801536527 0.003729747941000007 1 ) 
    ( 0.9879583806052372 0.0031818231313484324 1 ) 
    ( 0.9911436250481941 0.0027038542779942664 1 ) 
     ( 0.9938441700308243 0.002297150164531377 1 ) 
     ( 0.9960573504412771 0.001962833507358208 1 ) 
    ( 0.9977809821376927 0.0017018335027066797 1 ) 
     ( 0.9990133641036874 0.001514879558090701 1 ) 
    ( 0.9997532801270506 0.0014024963088501152 1 ) 
                    ( 1.0 0.001364999999999976 1 )  
	)																																																													
	spline	0	6													
	(
                                         ( 0.0 -0.0 0 ) 
 ( 0.00024671981657042874 -0.003011056366373696 0 ) 
  ( 0.0009866357836101902 -0.005980777568211032 0 ) 
  ( 0.0022190176933925554 -0.008907977508307338 0 ) 
   ( 0.003942649333762649 -0.011791184190268244 0 ) 
   ( 0.006155829688391956 -0.014628648783357387 0 ) 
   ( 0.008856374615475837 -0.017418358086832952 0 ) 
   ( 0.012041619003218151 -0.020158050243675476 0 ) 
   ( 0.015708419399974638 -0.022845233514267305 0 ) 
    ( 0.01985315711646002 -0.025477207883824238 0 ) 
     ( 0.02447174179695788 -0.02805108924368974 0 ) 
   ( 0.029559615456007327 -0.030563835856436187 0 ) 
    ( 0.03511175697658486 -0.033012276788478075 0 ) 
    ( 0.04112268706534028 -0.035393141971924565 0 ) 
   ( 0.047586473659998074 -0.037703093539972345 0 ) 
    ( 0.05449673778358616 -0.039938758067472394 0 ) 
     ( 0.06184665983971649 -0.04209675934054878 0 ) 
    ( 0.06962898634270315 -0.044173751276374226 0 ) 
    ( 0.07783603707587677 -0.046166450616426054 0 ) 
     ( 0.08645971267103159 -0.04807166902368653 0 ) 
     ( 0.0954915026015235 -0.049886344226178596 0 ) 
     ( 0.10492249358113281 -0.05160756986573828 0 ) 
     ( 0.11474337836040116 -0.05323262373174853 0 ) 
    ( 0.12494446491176331 -0.054758994084367636 0 ) 
     ( 0.13551568599440833 -0.05618440380019647 0 ) 
      ( 0.1464466090894303 -0.05750683210490852 0 ) 
     ( 0.1577264466954656 -0.058724533691640754 0 ) 
     ( 0.16934406697465365 -0.05983605506040259 0 ) 
     ( 0.18128800473841744 -0.06084024795186573 0 ) 
     ( 0.1935464727622202 -0.061736279788094844 0 ) 
     ( 0.20610737341813284 -0.06252364107249962 0 ) 
     ( 0.21895831061373222 -0.06320214974096375 0 ) 
      ( 0.2320866020255476 -0.06377195249517066 0 ) 
     ( 0.24547929161498316 -0.06423352318705511 0 ) 
      ( 0.2591231624143632 -0.06458765835953159 0 ) 
       ( 0.273004749570484 -0.06483547008269425 0 ) 
       ( 0.287110353632798 -0.06497837625608863 0 ) 
     ( 0.30142605407311807 -0.06501808857600697 0 ) 
       ( 0.315937723023497 -0.06495659839169517 0 ) 
      ( 0.3306310392187286 -0.06479616069556887 0 ) 
       ( 0.345491502129707 -0.06453927650976939 0 ) 
      ( 0.3605044462736979 -0.06418867394446111 0 ) 
      ( 0.3756550556873999 -0.06374728821205485 0 ) 
      ( 0.3909283785485107 -0.06321824088598382 0 ) 
      ( 0.40630934193137186 -0.0626048186927659 0 ) 
      ( 0.4217827666821252 -0.06191045212193702 0 ) 
    ( 0.43733338239870584 -0.061138694130171346 0 ) 
      ( 0.4529458425008854 -0.06029319920371736 0 ) 
       ( 0.468604739375493 -0.05937770302743052 0 ) 
      ( 0.4842946195818704 -0.05839600298948353 0 ) 
      ( 0.4999999991025516 -0.05735193972864462 0 ) 
      ( 0.5157053786241185 -0.05624937990622778 0 ) 
     ( 0.5313952588331522 -0.055092200357873905 0 ) 
      ( 0.5470541557121839 -0.05388427375168082 0 ) 
      ( 0.5626666158205507 -0.05262945584934227 0 ) 
     ( 0.5782172315450762 -0.051331574436378855 0 ) 
       ( 0.593690656305524 -0.04999441995674711 0 ) 
      ( 0.6090716196998196 -0.04862173785658866 0 ) 
      ( 0.6243449425740935 -0.04721722261212231 0 ) 
      ( 0.6394955520026742 -0.04578451338814363 0 ) 
      ( 0.6545084961632448 -0.04432719124673248 0 ) 
       ( 0.6693689590924875 -0.0428487778009735 0 ) 
      ( 0.6840622753076503 -0.04135273518614925 0 ) 
     ( 0.6985739442796073 -0.039842467201284835 0 ) 
      ( 0.7128896447431308 -0.03832132145738961 0 ) 
      ( 0.7269952488302514 -0.03679259235547389 0 ) 
      ( 0.7408768360127569 -0.03525952470758601 0 ) 
      ( 0.7545207068400739 -0.03372531780782209 0 ) 
      ( 0.7679133964589709 -0.03219312975755997 0 ) 
     ( 0.7810416879017434 -0.030666081850047138 0 ) 
     ( 0.7938926251297652 -0.029147262823857847 0 ) 
     ( 0.8064535258195331 -0.027639732802503255 0 ) 
     ( 0.8187119938785907 -0.026146526748445986 0 ) 
     ( 0.8306559316789744 -0.024670657273703284 0 ) 
      ( 0.8422735519961111 -0.02321511666583936 0 ) 
      ( 0.853553389641386 -0.021782878007129698 0 ) 
     ( 0.8644843127769004 -0.020376895285661202 0 ) 
      ( 0.8750555339012502 -0.01900010241973056 0 ) 
      ( 0.8852566204954886 -0.01765541114070042 0 ) 
     ( 0.8950775053187623 -0.016345707704044733 0 ) 
     ( 0.9045084963434626 -0.015073848423217347 0 ) 
      ( 0.9135402863200868 -0.01384265404577629 0 ) 
     ( 0.9221639619623694 -0.012654903015452051 0 ) 
     ( 0.9303710127436202 -0.011513323687140064 0 ) 
     ( 0.9381533392955854 -0.010420585583724716 0 ) 
     ( 0.9455032614015477 -0.009379289803826229 0 ) 
     ( 0.9524135255757721 -0.008391958707660073 0 ) 
    ( 0.9588773122218202 -0.0074610250239063765 0 ) 
     ( 0.9648882423626697 -0.006588820533539079 0 ) 
     ( 0.9704403839359932 -0.005777564496748482 0 ) 
     ( 0.9755282576483886 -0.005029351996240818 0 ) 
     ( 0.9801468423827797 -0.004346142374200061 0 ) 
     ( 0.9842915801536527 -0.003729747941000007 0 ) 
    ( 0.9879583806052372 -0.0031818231313484324 0 ) 
    ( 0.9911436250481941 -0.0027038542779942664 0 ) 
     ( 0.9938441700308243 -0.002297150164531377 0 ) 
     ( 0.9960573504412771 -0.001962833507358208 0 ) 
    ( 0.9977809821376927 -0.0017018335027066797 0 ) 
     ( 0.9990133641036874 -0.001514879558090701 0 ) 
    ( 0.9997532801270506 -0.0014024963088501152 0 ) 
                    ( 1.0 -0.001364999999999976 0 )  
    )
    spline 10 16
    (
                                         ( 0.0 -0.0 1 ) 
 ( 0.00024671981657042874 -0.003011056366373696 1 ) 
  ( 0.0009866357836101902 -0.005980777568211032 1 ) 
  ( 0.0022190176933925554 -0.008907977508307338 1 ) 
   ( 0.003942649333762649 -0.011791184190268244 1 ) 
   ( 0.006155829688391956 -0.014628648783357387 1 ) 
   ( 0.008856374615475837 -0.017418358086832952 1 ) 
   ( 0.012041619003218151 -0.020158050243675476 1 ) 
   ( 0.015708419399974638 -0.022845233514267305 1 ) 
    ( 0.01985315711646002 -0.025477207883824238 1 ) 
     ( 0.02447174179695788 -0.02805108924368974 1 ) 
   ( 0.029559615456007327 -0.030563835856436187 1 ) 
    ( 0.03511175697658486 -0.033012276788478075 1 ) 
    ( 0.04112268706534028 -0.035393141971924565 1 ) 
   ( 0.047586473659998074 -0.037703093539972345 1 ) 
    ( 0.05449673778358616 -0.039938758067472394 1 ) 
     ( 0.06184665983971649 -0.04209675934054878 1 ) 
    ( 0.06962898634270315 -0.044173751276374226 1 ) 
    ( 0.07783603707587677 -0.046166450616426054 1 ) 
     ( 0.08645971267103159 -0.04807166902368653 1 ) 
     ( 0.0954915026015235 -0.049886344226178596 1 ) 
     ( 0.10492249358113281 -0.05160756986573828 1 ) 
     ( 0.11474337836040116 -0.05323262373174853 1 ) 
    ( 0.12494446491176331 -0.054758994084367636 1 ) 
     ( 0.13551568599440833 -0.05618440380019647 1 ) 
      ( 0.1464466090894303 -0.05750683210490852 1 ) 
     ( 0.1577264466954656 -0.058724533691640754 1 ) 
     ( 0.16934406697465365 -0.05983605506040259 1 ) 
     ( 0.18128800473841744 -0.06084024795186573 1 ) 
     ( 0.1935464727622202 -0.061736279788094844 1 ) 
     ( 0.20610737341813284 -0.06252364107249962 1 ) 
     ( 0.21895831061373222 -0.06320214974096375 1 ) 
      ( 0.2320866020255476 -0.06377195249517066 1 ) 
     ( 0.24547929161498316 -0.06423352318705511 1 ) 
      ( 0.2591231624143632 -0.06458765835953159 1 ) 
       ( 0.273004749570484 -0.06483547008269425 1 ) 
       ( 0.287110353632798 -0.06497837625608863 1 ) 
     ( 0.30142605407311807 -0.06501808857600697 1 ) 
       ( 0.315937723023497 -0.06495659839169517 1 ) 
      ( 0.3306310392187286 -0.06479616069556887 1 ) 
       ( 0.345491502129707 -0.06453927650976939 1 ) 
      ( 0.3605044462736979 -0.06418867394446111 1 ) 
      ( 0.3756550556873999 -0.06374728821205485 1 ) 
      ( 0.3909283785485107 -0.06321824088598382 1 ) 
      ( 0.40630934193137186 -0.0626048186927659 1 ) 
      ( 0.4217827666821252 -0.06191045212193702 1 ) 
    ( 0.43733338239870584 -0.061138694130171346 1 ) 
      ( 0.4529458425008854 -0.06029319920371736 1 ) 
       ( 0.468604739375493 -0.05937770302743052 1 ) 
      ( 0.4842946195818704 -0.05839600298948353 1 ) 
      ( 0.4999999991025516 -0.05735193972864462 1 ) 
      ( 0.5157053786241185 -0.05624937990622778 1 ) 
     ( 0.5313952588331522 -0.055092200357873905 1 ) 
      ( 0.5470541557121839 -0.05388427375168082 1 ) 
      ( 0.5626666158205507 -0.05262945584934227 1 ) 
     ( 0.5782172315450762 -0.051331574436378855 1 ) 
       ( 0.593690656305524 -0.04999441995674711 1 ) 
      ( 0.6090716196998196 -0.04862173785658866 1 ) 
      ( 0.6243449425740935 -0.04721722261212231 1 ) 
      ( 0.6394955520026742 -0.04578451338814363 1 ) 
      ( 0.6545084961632448 -0.04432719124673248 1 ) 
       ( 0.6693689590924875 -0.0428487778009735 1 ) 
      ( 0.6840622753076503 -0.04135273518614925 1 ) 
     ( 0.6985739442796073 -0.039842467201284835 1 ) 
      ( 0.7128896447431308 -0.03832132145738961 1 ) 
      ( 0.7269952488302514 -0.03679259235547389 1 ) 
      ( 0.7408768360127569 -0.03525952470758601 1 ) 
      ( 0.7545207068400739 -0.03372531780782209 1 ) 
      ( 0.7679133964589709 -0.03219312975755997 1 ) 
     ( 0.7810416879017434 -0.030666081850047138 1 ) 
     ( 0.7938926251297652 -0.029147262823857847 1 ) 
     ( 0.8064535258195331 -0.027639732802503255 1 ) 
     ( 0.8187119938785907 -0.026146526748445986 1 ) 
     ( 0.8306559316789744 -0.024670657273703284 1 ) 
      ( 0.8422735519961111 -0.02321511666583936 1 ) 
      ( 0.853553389641386 -0.021782878007129698 1 ) 
     ( 0.8644843127769004 -0.020376895285661202 1 ) 
      ( 0.8750555339012502 -0.01900010241973056 1 ) 
      ( 0.8852566204954886 -0.01765541114070042 1 ) 
     ( 0.8950775053187623 -0.016345707704044733 1 ) 
     ( 0.9045084963434626 -0.015073848423217347 1 ) 
      ( 0.9135402863200868 -0.01384265404577629 1 ) 
     ( 0.9221639619623694 -0.012654903015452051 1 ) 
     ( 0.9303710127436202 -0.011513323687140064 1 ) 
     ( 0.9381533392955854 -0.010420585583724716 1 ) 
     ( 0.9455032614015477 -0.009379289803826229 1 ) 
     ( 0.9524135255757721 -0.008391958707660073 1 ) 
    ( 0.9588773122218202 -0.0074610250239063765 1 ) 
     ( 0.9648882423626697 -0.006588820533539079 1 ) 
     ( 0.9704403839359932 -0.005777564496748482 1 ) 
     ( 0.9755282576483886 -0.005029351996240818 1 ) 
     ( 0.9801468423827797 -0.004346142374200061 1 ) 
     ( 0.9842915801536527 -0.003729747941000007 1 ) 
    ( 0.9879583806052372 -0.0031818231313484324 1 ) 
    ( 0.9911436250481941 -0.0027038542779942664 1 ) 
     ( 0.9938441700308243 -0.002297150164531377 1 ) 
     ( 0.9960573504412771 -0.001962833507358208 1 ) 
    ( 0.9977809821376927 -0.0017018335027066797 1 ) 
     ( 0.9990133641036874 -0.001514879558090701 1 ) 
    ( 0.9997532801270506 -0.0014024963088501152 1 ) 
                    ( 1.0 -0.001364999999999976 1 )  
							
    )															
                                                                    
                                                                    
    );																
                                                                    
    faces																
    (																
                                                                    
    );																
                                                                    
    faces																
    (																
                                                                    
    );																
                                                                    
                                                                    
    defaultPatch																
    {																
        name frontAndBack;																
        type empty;																
    }		
                                                                                                                                
    boundary																
    (																
        inlet              																
            {																
            type patch;    																
            faces																
            (																
                (3 13 12 2)
                (8 18 13 3)
                (5 2 12 15)
                (8 9 19 18)															
            );																
            } 
        outlet              																
            {																
            type patch;    																
            faces																
            (																
                (4 5 15 14)
                (7 4 14 17)
                (7 17 19 9)  															
            );																
            }	

        foil              																
            {																
            type wall;    																
            faces																
            (																
                (0 1 11 10)
                (0 6 16 10)
                (6 1 11 16)															
            );																
            }	
                                                                
                                                                        
    );	
    // ************************************************************************* //																
                                                                    			               	
    